Some Spot Dimensions lost their References. Those Spot Dimensions will be deleted.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SpotElevationLostEdgeReferences { get; }
  Visual Basic
Public Shared ReadOnly Property SpotElevationLostEdgeReferences As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SpotElevationLostEdgeReferences {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DimensionFailures Class
  Autodesk.Revit.DB Namespace